Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4S2A.xml
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x00C" rw="W" size="4">
          <bitfield caption="DMA Disable Register" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x010" rw="R" size="4">
          <bitfield caption="DMA Status Register" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x014" rw="W" size="4">
          <bitfield caption="Interrupt Enable register" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x018" rw="W" size="4">
          <bitfield caption="Interrupt Disable register" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x001C" rw="R" size="4">
          <bitfield caption="Interrupt Mask Register" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x020" rw="R" size="4">
          <bitfield caption="Interrupt Status register" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x03C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
        <register caption="CRCCU Interrupt Enable Register" name="CRCCU_IER" offset="0x040" rw="W" size="4">
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000001" name="ERRIER"/>
        </register>
        <register caption="CRCCU Interrupt Disable Register" name="CRCCU_IDR" offset="0x044" rw="W" size="4">
          <bitfield caption="CRC Error Interrupt Disable" mask="0x00000001" name="ERRIDR"/>
        </register>
        <register caption="CRCCU Interrupt Mask Register" name="CRCCU_IMR" offset="0x048" rw="R" size="4">
          <bitfield caption="CRC Error Interrupt Mask" mask="0x00000001" name="ERRIMR"/>
        </register>
        <register caption="CRCCU Interrupt Status Register" name="CRCCU_ISR" offset="0x004C" rw="R" size="4">
          <bitfield caption="CRC Error Interrupt Status" mask="0x00000001" name="ERRISR"/>
        </register>
      </register-group>
      <value-group caption="" name="CRCCU_MR__PTYPE">
        <value caption="Polynom 0x04C11DB7" name="CCITT8023" value="0x0"/>
        <value caption="Polynom 0x1EDC6F41" name="CASTAGNOLI" value="0x1"/>
        <value caption="Polynom 0x1021" name="CCITT16" value="0x2"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450M">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
